https://nbviewer.jupyter.org/github/Yorko/mlcourse.ai/blob/master/jupyter_english/tutorials/merging_dataframes_tutorial_max_palko.ipynb

In [2]:
import pandas as pd

In [3]:
revenue = pd.read_csv("data/revenue.csv")
managers = pd.read_csv("data/managers.csv")
print(revenue)
print(managers)

          city  revenue
0       Austin      100
1       Denver       83
2  Springfield        4
        city   manager
0     Austin  Charlers
1     Denver      Joel
2  Mendocino     Brett

In [5]:
combined = pd.merge(revenue, managers, on='city')
print(combined)

     city  revenue   manager
0  Austin      100  Charlers
1  Denver       83      Joel

In [6]:
revenue = pd.read_csv("data/revenue_branch_id.csv")
managers = pd.read_csv("data/managers_branch_id.csv")
print(revenue)
print(managers)

   branch_id         city  revenue
0         10       Austin      100
1         20       Denver       83
2         30  Springfield        4
3         47    Mendocino      200
   branch_id         city   manager
0         10       Austin  Charlers
1         20       Denver      Joel
2         47    Mendocino     Brett
3         31  Springfield     Sally

In [7]:
combined = pd.merge(revenue, managers, on='city')
print(combined)

   branch_id_x         city  revenue  branch_id_y   manager
0           10       Austin      100           10  Charlers
1           20       Denver       83           20      Joel
2           30  Springfield        4           31     Sally
3           47    Mendocino      200           47     Brett

In [8]:
combined = pd.merge(revenue, managers, on='branch_id')
print(combined)

   branch_id     city_x  revenue     city_y   manager
0         10     Austin      100     Austin  Charlers
1         20     Denver       83     Denver      Joel
2         47  Mendocino      200  Mendocino     Brett

In [9]:
revenue = pd.read_csv("data/revenue_branch_id_2.csv")
managers = pd.read_csv("data/managers_branch_id_2.csv")
print(revenue)
print(managers)

   branch_id         city  revenue
0         10       Austin      100
1         20       Denver       83
2         30  Springfield        4
3         47    Mendocino      200
   branch_id       branch   manager
0         10       Austin  Charlers
1         20       Denver      Joel
2         47    Mendocino     Brett
3         31  Springfield     Sally

In [10]:
combined = pd.merge(revenue, managers, left_on='city', right_on='branch')
print(combined)

   branch_id_x         city  revenue  branch_id_y       branch   manager
0           10       Austin      100           10       Austin  Charlers
1           20       Denver       83           20       Denver      Joel
2           30  Springfield        4           31  Springfield     Sally
3           47    Mendocino      200           47    Mendocino     Brett

In [11]:
revenue = pd.read_csv("data/revenue_branch_id.csv")
managers = pd.read_csv("data/managers_branch_id.csv")
revenue['state'] = ['TX', 'CO', 'IL', 'CA']
managers['state'] = ['TX', 'CO', 'CA', 'MO']
print(revenue)
print(managers)

   branch_id         city  revenue state
0         10       Austin      100    TX
1         20       Denver       83    CO
2         30  Springfield        4    IL
3         47    Mendocino      200    CA
   branch_id         city   manager state
0         10       Austin  Charlers    TX
1         20       Denver      Joel    CO
2         47    Mendocino     Brett    CA
3         31  Springfield     Sally    MO

In [16]:
pd.merge(revenue, managers, on=['city', 'branch_id', 'state'])

   branch_id       city  revenue state   manager
0         10     Austin      100    TX  Charlers
1         20     Denver       83    CO      Joel
2         47  Mendocino      200    CA     Brett

In [18]:
managers = pd.read_csv("data/managers_branch_id_2.csv")
managers['state'] = ['TX', 'CO', 'CA', 'MO']
sales = pd.read_csv("data/sales.csv")
print(sales)

          city state  units
0    Mendocino    CA      1
1       Denver    CO      4
2       Austin    TX      2
3  Springfield    MO      5
4  Springfield    IL      1

In [20]:
revenue_and_sales = pd.merge(revenue, sales, how='right', on=['city', 'state'])
print(revenue_and_sales)

   branch_id         city  revenue state  units
0       10.0       Austin    100.0    TX      2
1       20.0       Denver     83.0    CO      4
2       30.0  Springfield      4.0    IL      1
3       47.0    Mendocino    200.0    CA      1
4        NaN  Springfield      NaN    MO      5

In [25]:
sales_and_managers = pd.merge(sales, managers, how='left', left_on=['city', 'state'], right_on=['branch', 'state'])
print(sales_and_managers)

          city state  units  branch_id       branch   manager
0    Mendocino    CA      1       47.0    Mendocino     Brett
1       Denver    CO      4       20.0       Denver      Joel
2       Austin    TX      2       10.0       Austin  Charlers
3  Springfield    MO      5       31.0  Springfield     Sally
4  Springfield    IL      1        NaN          NaN       NaN

In [27]:
pd.merge(sales_and_managers, revenue_and_sales)

        city state  units  branch_id     branch   manager  revenue
0  Mendocino    CA      1       47.0  Mendocino     Brett    200.0
1     Denver    CO      4       20.0     Denver      Joel     83.0
2     Austin    TX      2       10.0     Austin  Charlers    100.0

In [29]:
pd.merge(sales_and_managers, revenue_and_sales, how='outer')

          city state  units  branch_id       branch   manager  revenue
0    Mendocino    CA      1       47.0    Mendocino     Brett    200.0
1       Denver    CO      4       20.0       Denver      Joel     83.0
2       Austin    TX      2       10.0       Austin  Charlers    100.0
3  Springfield    MO      5       31.0  Springfield     Sally      NaN
4  Springfield    IL      1        NaN          NaN       NaN      NaN
5  Springfield    IL      1       30.0          NaN       NaN      4.0
6  Springfield    MO      5        NaN          NaN       NaN      NaN

In [30]:
pd.merge(sales_and_managers, revenue_and_sales, how='outer', on=['city', 'state'])

,city,state,units_x,branch_id_x,branch,manager,branch_id_y,revenue,units_y
0,Mendocino,CA,1,47.0,Mendocino,Brett,47.0,200.0,1
1,Denver,CO,4,20.0,Denver,Joel,20.0,83.0,4
2,Austin,TX,2,10.0,Austin,Charlers,10.0,100.0,2
3,Springfield,MO,5,31.0,Springfield,Sally,NaN,NaN,5
4,Springfield,IL,1,NaN,NaN,NaN,30.0,4.0,1

### Merge sort

In [31]:
austin = pd.read_csv("data/austin.csv")
houston = pd.read_csv("data/houston.csv")
print(austin)
print(houston)

         date ratings
0  2016-01-01  Cloudy
1  2016-02-08  Cloudy
2  2016-01-17   Sunny
         date ratings
0  2016-01-04   Rainy
1  2016-01-01  Cloudy
2  2016-03-01   Sunny

In [32]:
pd.merge_ordered(austin, houston)

         date ratings
0  2016-01-01  Cloudy
1  2016-01-04   Rainy
2  2016-01-17   Sunny
3  2016-02-08  Cloudy
4  2016-03-01   Sunny

In [33]:
pd.merge_ordered(austin, houston, on='date', suffixes=['_aus', '_hou'])

         date ratings_aus ratings_hou
0  2016-01-01      Cloudy      Cloudy
1  2016-01-04         NaN       Rainy
2  2016-01-17       Sunny         NaN
3  2016-02-08      Cloudy         NaN
4  2016-03-01         NaN       Sunny

In [34]:
pd.merge_ordered(austin, houston, on='date', suffixes=['_aus', '_hou'], fill_method='ffill')

         date ratings_aus ratings_hou
0  2016-01-01      Cloudy      Cloudy
1  2016-01-04      Cloudy       Rainy
2  2016-01-17       Sunny       Rainy
3  2016-02-08      Cloudy       Rainy
4  2016-03-01      Cloudy       Sunny